
import Foundation

/*:
 # Home Work 1
 
 ## Задание 1
 
 Объявите константу `firstString` со значением "I can" и `secondString` со значением "code". В значениях констант ни каких хитростей с лишними пробелами быть не должно. Выведите на консоль фразу **"I can code!"** с восклицательным знаком, используя эти строковые свойства.
 */
let firstString = "I can"
let secondString = "code"

print("\(firstString) \(secondString)!")

//Задание 1
//Все сделано хорошо, лаконично и правильно. Никаких замечаний у меня нет. Для вывода результата на консоль ты используешь интерполяцию строк. Это можно было сделать так же при помощи конкатенации. Подробнее об этих концепциях поговорим на предстоящем уроке

//: Задание 1 из 3  |  [Далее: Задание 2](@next)
